Repository: appchoiradmin/ChoirApp
Catalog: packages/backend/src/ChoirApp.Backend/Resources/SharedResources.*.resx
Languages: es

# UserNotAuthenticated
source: User not authenticated properly.
es: Usuario no autenticado correctamente.

source: Choir not found.
es: Coro no encontrado.

source: Song not found.
es: Canción no encontrada.

source: Playlist not found.
es: Lista de reproducción no encontrada.

# UnauthorizedAccess
source: You are not authorized to perform this action.
es: No estás autorizado para realizar esta acción.

# ValidationError
source: Please check your input and try again.
es: Por favor verifica tu entrada e intenta de nuevo.

# ServerError
source: An internal server error occurred. Please try again later.
es: Ocurrió un error interno del servidor. Por favor intenta más tarde.

# NetworkError
source: Network error. Please check your connection.
es: Error de red. Por favor verifica tu conexión.

# ChoirCreated
source: Choir created successfully.
es: Coro creado exitosamente.

# SongAdded
source: Song added successfully.
es: Canción agregada exitosamente.

# PlaylistUpdated
source: Playlist updated successfully.
es: Lista de reproducción actualizada exitosamente.

# InvitationSent
source: Invitation sent successfully.
es: Invitación enviada exitosamente.

# RequiredField
source: This field is required.
es: Este campo es requerido.

# InvalidEmail
source: Please enter a valid email address.
es: Por favor ingresa una dirección de email válida.

# ChoirNameTooShort
source: Choir name must be at least 3 characters long.
es: El nombre del coro debe tener al menos 3 caracteres.

# SongTitleRequired
source: Song title is required.
es: El título de la canción es requerido.
